Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "soluble ea terraform-plan-scan --plan $SHOWFILE --format atlantis --fail low=1" in "/Users/aedifex/.atlantis/repos/aedifex/lacework-atlantis-demo/2/default": exit status 2: running "soluble ea terraform-plan-scan --plan $SHOWFILE --format atlantis --fail low=1" in "/Users/aedifex/.atlantis/repos/aedifex/lacework-atlantis-demo/2/default": 
[ Info] Getting https://api.soluble.cloud/api/v1/org/836920872584/custom/policies/checkov-terraform-plan/rules.tgz
[ Info] Installing rules.tgz
[ Info] checkov-terraform-plan has no custom policies
[ Info] POST https://api.soluble.cloud/api/v1/xcp/checkov/data returned 200 in 2.732s
[ Info] Asessment uploaded, see https://app.soluble.cloud/assessments/details/133?orgId=836920872584 for more information
Results:
Passed: 3 | Failed: 1 | Suppressed: 0

Violations:
Critical: 0 | High: 0 | Medium: 0 | Low: 1 | Info : 0

❌ Ensure that Security Groups are attached to another resource
	Severity: Low
	Resource: aws_security_group.bad_example


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.bad_example will be created
  + resource "aws_security_group" "bad_example" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 1234
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1234
            },
        ]
      + name                   = "a_bad_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # null_resource.example will be created
  + resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/aedifex/.atlantis/repos/aedifex/lacework-atlantis-demo/2/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/aedifex/.atlantis/repos/aedifex/lacework-atlantis-demo/2/default/default.tfplan"

```
</details>

